app/Controllers/Customers.php

    public function customeredit($id = null)
    {


        $Customers = new CustomerModel();


        $data1 = $Customers->where('id_customers', $id)->findAll();
---
SELECT *
FROM `db_customers`
WHERE `id_customers` = '1'


            ];

            $Customers->update($id, $data);
---
UPDATE `db_customers` SET `customers` = '#denpasara', `nama` = 'dasdasdas', `telp` = '(+62 1__) ___-1231', `hp` = '(+62 11) 1__-___-___', `wa` = '(+62 85) 792-693-693', `alamat` = 'jalan imam bonjol gg.segina VI no.31', `updated_at` = '2022-06-26 10:40:58'
WHERE `db_customers`.`id_customers` IN ('1')