app/Controllers/Home.php

SELECT *
FROM `db_harga_kayu`
WHERE `id_harga_kayu` = '1'
---

                            // get profil
                            $data1 = $Persediaan->where('id_persediaan', $value->id_persediaan)->findAll();
                            $data2 = $Harga->where('id_harga_kayu', $data1[0]->id_harga_kayu)->findAll();

SELECT *
FROM `db_jenis_kayu`
WHERE `id_jenis_kayu` = '2'
 LIMIT 1
---
                    $chart_PPT = [];
                    foreach ($dataCHRTtransaksi as $key1 => $value1) {

                            $getjeniskayu = $JenisKayu->where('id_jenis_kayu', $value1->id_jenis_kayu)->first();

SELECT COUNT(*) AS `numrows`
FROM `db_transaksi`
WHERE `tipe_pesanan` = 'Online Order'
AND  `tgl_transaksi` LIKE '%2022-09%' ESCAPE '!'
---
                    ];
                    foreach ($dataX_JPT as $key2 => $value_JPT) {

                            $count_JPT = $Transaksi
                                            ->where('tipe_pesanan', $value_JPT)
                                            ->like('tgl_transaksi', $x_BULAN_TAHUN)
                                            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `db_transaksi`
WHERE `tipe_pembayaran` = 'Tunai'
AND  `tgl_transaksi` LIKE '%2022-09%' ESCAPE '!'
---
                    ];
                    foreach ($dataX_JPYT as $key2 => $value_JPYT) {

                            $count_JPYT = $Transaksi
                                            ->where('tipe_pembayaran', $value_JPYT)
                                            ->like('tgl_transaksi', $x_BULAN_TAHUN)
                                            ->countAllResults();