app/Controllers/Stock.php

SELECT *
FROM `db_jenis_kayu`
---
  public function jenis()
    {

      $JenisKayuModels = new JenisKayuModel();

      $data = array(
                  'menu' => '3a',
                  'title' => 'Jenis Kayu [SIE-JAKU]',
                  'batascss' => 'c4a',
                  'JenisKayuModels' => $JenisKayuModels->findAll(),

SELECT *
FROM `db_jenis_kayu`
---
    public function tipe_edit($id = null)
    {

        $JenisKayus = new JenisKayuModel();
        $TipeKayus = new TipeKayuModel();


        $data = array(
            'menu' => '3a',
            'title' => 'Tipe Kayu [SIE-JAKU]',
            'batascss' => 'c4b',
            'dataTipeKayus' => $TipeKayus->find($id),
            'dataJenisKayus' => $JenisKayus->findall(),

SELECT *
FROM `db_ukuran_kayu`
WHERE `id_ukuran_kayu` = '1'
SELECT *
FROM `db_tipe_kayu`
WHERE `id_tipe_kayu` = '3'
SELECT *
FROM `db_jenis_kayu`
WHERE `id_jenis_kayu` = '2'
SELECT *
FROM `db_tipe_kayu`
WHERE `id_jenis_kayu` = '2'
SELECT *
FROM `db_jenis_kayu`
---
  public function ukuran_edit($id = null)
  {
        $UkuranKayus = new UkuranKayuModel();
        $JenisKayus = new JenisKayuModel();
        $TipeKayus = new TipeKayuModel();


        $data1 = $UkuranKayus->where('id_ukuran_kayu', $id)->findAll();
        $data2 = $TipeKayus->where('id_tipe_kayu', $data1[0]->id_tipe_kayu)->findAll();
        $data3 = $JenisKayus->where('id_jenis_kayu', $data2[0]->id_jenis_kayu)->findAll();


      $data = array(
          'menu' => '3a',
          'title' => 'Ukuran Kayu [SIE-JAKU]',
          'batascss' => 'c4c',
          'dataTipeKayus' => $data2,
          'dataTipeKayusall' => $TipeKayus->where('id_jenis_kayu', $data3[0]->id_jenis_kayu)->findAll(),
          'dataJenisKayus' => $JenisKayus->findAll(),

SELECT *
FROM `db_tipe_kayu`
WHERE `id_jenis_kayu` = '2'
---
  function add_ajax_tkayu($id = null)
  {
        $TipeKayus = new TipeKayuModel();
        $dataTipeKayus = $TipeKayus->where('id_jenis_kayu', $id)->findAll();

SELECT *
FROM `db_jenis_kayu`
---
  public function add_persediaan_kayu()
  {

        $JenisKayus = new JenisKayuModel();

        $data = array(
            'menu' => '3a',
            'title' => 'Persediaan Kayu [SIE-JAKU]',
            'batascss' => 'c4persediaan',
            'dataJenisKayus' => $JenisKayus->findAll(),

        );