app/Controllers/Stock.php

  public function add_ukuran_kayu()
  {
        $JenisKayus = new JenisKayuModel();

        $data = array(
            'menu' => '3a',
            'title' => 'Ukuran Kayu [SIE-JAKU]',
            'batascss' => 'c4c',
            'dataJenisKayus' => $JenisKayus->findall(),
        );
---
SELECT *
FROM `db_jenis_kayu`

  public function add_persediaan_kayu()
  {

        $JenisKayus = new JenisKayuModel();

        $data = array(
            'menu' => '3a',
            'title' => 'Persediaan Kayu [SIE-JAKU]',
            'batascss' => 'c4persediaan',
            'dataJenisKayus' => $JenisKayus->findAll(),
---
SELECT *
FROM `db_jenis_kayu`