app/Controllers/Transaksi.php

SELECT *
FROM `db_tipe_kayu`
SELECT *
FROM `db_jenis_kayu`
SELECT *
FROM `db_ukuran_kayu`
SELECT *
FROM `db_customers`
---
    public function add_transaksi()
    {

        $UkuranKayus = new UkuranKayuModel();
        $JenisKayus = new JenisKayuModel();
        $TipeKayus = new TipeKayuModel();
        $Customers = new CustomerModel();


        $data = array(
			'menu' => '4a',
			'title' => 'Transaksi [SIE-JAKU]',
            'batascss' => 'c5s',
            'dataTipeKayus' => $TipeKayus->findAll(),
            'dataJenisKayus' => $JenisKayus->findAll(),
            'dataUkuranKayus' => $UkuranKayus->findAll(),
            'dataCustomers' => $Customers->findAll(),

SELECT *
FROM `db_persediaan_kayu`
WHERE `id_ukuran_kayu` = '1'
---
    function add_ajax_persediaan($id = null)
    {
          $pecah = explode("-",$id);

            $id_jenis_kayu = $pecah[0];
            $id_tipe_kayu = $pecah[1];
            $id_ukuran_kayu = $pecah[2];


            $PersediaanKayus = new PersediaanKayuModel();
            $dataPersediaanKayus = $PersediaanKayus->where('id_ukuran_kayu', $id_ukuran_kayu, 'id_tipe_kayu', $id_tipe_kayu, 'id_jenis_kayu', $id_jenis_kayu, )->findAll();

SELECT *
FROM `db_persediaan_kayu`
WHERE `id_persediaan` = '2'
 LIMIT 1
---
    function add_ajax_jmlp($id = null)
    {
        $pecah = explode("-",$id);

        $id_jenis_kayu = $pecah[0];
        $id_tipe_kayu = $pecah[1];
        $id_ukuran_kayu = $pecah[2];
        $id_persediaan = $pecah[3];



        $PersediaanKayus = new PersediaanKayuModel();
        $dataPersediaanKayus = $PersediaanKayus->where('id_persediaan', $id_persediaan, 'id_ukuran_kayu', $id_ukuran_kayu, 'id_tipe_kayu', $id_tipe_kayu, 'id_jenis_kayu', $id_jenis_kayu, )->findAll();