app/Controllers/UserLogin.php

SELECT *
FROM `db_users`
---
    public function index()
    {
        $users = new UserModel();

        $data = array(
			'menu' => '1a',
			'title' => 'User Login [SIE-JAKU]',
            'batascss' => 'c1',
            'datausers' => $users->findAll(),