app/Models/CustomerModel.php

SELECT *
FROM `db_customers`
WHERE `created_at` LIKE '%2022-09%' ESCAPE '!'
SELECT *
FROM `db_customers`
WHERE `created_at` LIKE '%-04-%' ESCAPE '!'
OR  `created_at` LIKE '%-05-%' ESCAPE '!'
OR  `created_at` LIKE '%-06-%' ESCAPE '!'
AND  `created_at` LIKE '%2022%' ESCAPE '!'
---
    function getwhere_bulanandtahun($bln = null, $thn = null)
    {
        $builder = $this->db->table('db_customers');
        $builder->like('created_at', $thn.'-'.$bln);

        $query = $builder->get();

        return $query->getResult();

SELECT *
FROM `db_customers`
WHERE `tgl_code` LIKE '%2022-09%' ESCAPE '!'
GROUP BY `tgl_code`
---
    function getChartwhere_bulanandtahun($bln = null, $thn = null)
    {
       /*  $builder = $this->db->table('db_customers');
        $builder->like('tgl_code', $thn.'-'.$bln);
        $builder->groupBy('tgl_code');

        $query = $builder->get();

SELECT *
FROM `db_customers`
WHERE `created_at` LIKE '%2019-%' ESCAPE '!'
---
    function getwhere_tahun($thn = null)
    {
        $builder = $this->db->table('db_customers');
        $builder->like('created_at', $thn.'-');

        $query = $builder->get();

SELECT *
FROM `db_customers`
WHERE `created_at` LIKE '%2022-%' ESCAPE '!'
---
    function getjoinall()
    {
        $builder = $this->db->table('db_customers');
        $builder->join('wilayah_provinsi', 'db_customers.provinsi_id = wilayah_provinsi.id');
        $builder->join('wilayah_kabupaten', 'db_customers.kabupaten_id = wilayah_kabupaten.id');
        $builder->join('wilayah_kecamatan', 'db_customers.kecamatan_id = wilayah_kecamatan.id');
        $builder->join('wilayah_desa', 'db_customers.desa_id = wilayah_desa.id');
        $query = $builder->get();

        return $query->getResult();