app/Models/PersediaanKayuModel.php

SELECT *
FROM `db_persediaan_kayu`
JOIN `db_jenis_kayu` ON `db_jenis_kayu`.`id_jenis_kayu` = `db_persediaan_kayu`.`id_jenis_kayu`
JOIN `db_tipe_kayu` ON `db_tipe_kayu`.`id_tipe_kayu` = `db_persediaan_kayu`.`id_tipe_kayu`
JOIN `db_ukuran_kayu` ON `db_ukuran_kayu`.`id_ukuran_kayu` = `db_persediaan_kayu`.`id_ukuran_kayu`
---
    function getjoinall()
    {
        $builder = $this->db->table('db_persediaan_kayu');
        $builder->join('db_jenis_kayu', 'db_jenis_kayu.id_jenis_kayu = db_persediaan_kayu.id_jenis_kayu');
        $builder->join('db_tipe_kayu', 'db_tipe_kayu.id_tipe_kayu = db_persediaan_kayu.id_tipe_kayu');
        $builder->join('db_ukuran_kayu', 'db_persediaan_kayu.id_ukuran_kayu = db_ukuran_kayu.id_ukuran_kayu');
        $builder->join('db_harga_kayu', 'db_persediaan_kayu.id_harga_kayu = db_harga_kayu.id_harga_kayu');
        $query = $builder->get();

SELECT *
FROM `db_persediaan_kayu`
WHERE `Tanggal_persediaan` LIKE '%-04-%' ESCAPE '!'
OR  `Tanggal_persediaan` LIKE '%-05-%' ESCAPE '!'
OR  `Tanggal_persediaan` LIKE '%-06-%' ESCAPE '!'
AND  `Tanggal_persediaan` LIKE '%2022%' ESCAPE '!'
---
    function getlikeall($bln1 = null, $bln2 = null, $bln3 = null, $tahun = null)
    {
        $builder = $this->db->table('db_persediaan_kayu');
        $builder->like('Tanggal_persediaan', $bln1);
        $builder->orLike('Tanggal_persediaan', $bln2);
        $builder->orLike('Tanggal_persediaan', $bln3);
        $builder->like('Tanggal_persediaan', $tahun);
        $query = $builder->get();