app/Models/TipeKayuModel.php

SELECT *
FROM `db_tipe_kayu`
JOIN `db_jenis_kayu` ON `db_jenis_kayu`.`id_jenis_kayu` = `db_tipe_kayu`.`id_jenis_kayu`
---
    function getjoinall()
    {
        $builder = $this->db->table('db_tipe_kayu');
        $builder->join('db_jenis_kayu', 'db_jenis_kayu.id_jenis_kayu = db_tipe_kayu.id_jenis_kayu');
        $query = $builder->get();