app/Models/TransaksiModel.php

    function ChartTTPgetwhere_tahun($thn = null)
    {
        $builder = $this->db->table('db_transaksi');
        $builder->select('sum(total_harga) as hasil_ttl, DATE_FORMAT(tgl_transaksi, "%M") as tgl_transaksi, tgl_code');
        $builder->like('tgl_code', $thn.'-');
        $builder->groupBy('tgl_code');
        $query = $builder->get();
---
SELECT sum(total_harga) as hasil_ttl, DATE_FORMAT(tgl_transaksi, "%M") as tgl_transaksi, `tgl_code`
FROM `db_transaksi`
WHERE `tgl_code` LIKE '%-%' ESCAPE '!'
GROUP BY `tgl_code`