app/Models/TransaksiModel.php

    function getwhere_bulanandtahun($bln = null, $thn = null)
    {
        $builder = $this->db->table('db_transaksi');
        $builder->join('db_jenis_kayu', 'db_jenis_kayu.id_jenis_kayu = db_transaksi.id_jenis_kayu');
        $builder->join('db_tipe_kayu', 'db_tipe_kayu.id_tipe_kayu = db_transaksi.id_tipe_kayu');
        $builder->join('db_ukuran_kayu', 'db_ukuran_kayu.id_ukuran_kayu = db_transaksi.id_ukuran_kayu');
        $builder->join('db_persediaan_kayu', 'db_persediaan_kayu.id_persediaan  = db_transaksi.id_persediaan ');
        $builder->join('db_customers', 'db_customers.id_customers = db_transaksi.id_customers');

        $builder->like('tgl_transaksi', $thn.'-'.$bln);
        $builder->orderBy('tgl_transaksi', 'DESC');

        $query = $builder->get();
---
SELECT *
FROM `db_transaksi`
JOIN `db_jenis_kayu` ON `db_jenis_kayu`.`id_jenis_kayu` = `db_transaksi`.`id_jenis_kayu`
JOIN `db_tipe_kayu` ON `db_tipe_kayu`.`id_tipe_kayu` = `db_transaksi`.`id_tipe_kayu`
JOIN `db_ukuran_kayu` ON `db_ukuran_kayu`.`id_ukuran_kayu` = `db_transaksi`.`id_ukuran_kayu`
JOIN `db_persediaan_kayu` ON `db_persediaan_kayu`.`id_persediaan`  = `db_transaksi`.`id_persediaan`
JOIN `db_customers` ON `db_customers`.`id_customers` = `db_transaksi`.`id_customers`
WHERE `tgl_transaksi` LIKE '%2022-09%' ESCAPE '!'
ORDER BY `tgl_transaksi` DESC

    function getwhere_tahun($thn = null)
    {
        $builder = $this->db->table('db_transaksi');
        $builder->join('db_jenis_kayu', 'db_jenis_kayu.id_jenis_kayu = db_transaksi.id_jenis_kayu');
        $builder->join('db_tipe_kayu', 'db_tipe_kayu.id_tipe_kayu = db_transaksi.id_tipe_kayu');
        $builder->join('db_ukuran_kayu', 'db_ukuran_kayu.id_ukuran_kayu = db_transaksi.id_ukuran_kayu');
        $builder->join('db_persediaan_kayu', 'db_persediaan_kayu.id_persediaan  = db_transaksi.id_persediaan ');
        $builder->join('db_customers', 'db_customers.id_customers = db_transaksi.id_customers');

        $builder->like('tgl_transaksi', $thn.'-');
        $builder->orderBy('tgl_transaksi', 'DESC');

        $query = $builder->get();
---
SELECT *
FROM `db_transaksi`
JOIN `db_jenis_kayu` ON `db_jenis_kayu`.`id_jenis_kayu` = `db_transaksi`.`id_jenis_kayu`
JOIN `db_tipe_kayu` ON `db_tipe_kayu`.`id_tipe_kayu` = `db_transaksi`.`id_tipe_kayu`
JOIN `db_ukuran_kayu` ON `db_ukuran_kayu`.`id_ukuran_kayu` = `db_transaksi`.`id_ukuran_kayu`
JOIN `db_persediaan_kayu` ON `db_persediaan_kayu`.`id_persediaan`  = `db_transaksi`.`id_persediaan`
JOIN `db_customers` ON `db_customers`.`id_customers` = `db_transaksi`.`id_customers`
WHERE `tgl_transaksi` LIKE '%2022-%' ESCAPE '!'
ORDER BY `tgl_transaksi` DESC

    function Chartgetwhere_bulanandtahun($bln = null, $thn = null)
    {
        $builder = $this->db->table('db_transaksi');

        $builder->select('sum(total_harga) as hasil_ttl, tgl_code, id_jenis_kayu, tgl_transaksi');
        // $builder->select();
        $builder->like('tgl_transaksi', $thn.'-'.$bln);
        $builder->orderBy('tgl_transaksi', 'DESC');

        $builder->groupBy('id_jenis_kayu');
        // $builder->groupBy('tgl_code');

        $query = $builder->get();
---
SELECT sum(total_harga) as hasil_ttl, `tgl_code`, `id_jenis_kayu`, `tgl_transaksi`
FROM `db_transaksi`
WHERE `tgl_transaksi` LIKE '%2022-09%' ESCAPE '!'
GROUP BY `id_jenis_kayu`
ORDER BY `tgl_transaksi` DESC

    function ChartTTPgetwhere_bulanandtahun($bln = null, $thn = null, $typekayu = null)
    {
        $builder = $this->db->table('db_transaksi');

        $builder->select('sum(total_harga) as hasil_ttl, DATE_FORMAT(tgl_transaksi, "%Y-%M-%d") as tgl_transaksiz, id_jenis_kayu, tgl_transaksi');
        // $builder->select();

        if ($typekayu != 0) {
            $builder->where('id_jenis_kayu', $typekayu);
        }

        $builder->like('tgl_transaksi', $thn.'-'.$bln);
        $builder->orderBy('tgl_transaksi', 'DESC');

        // $builder->groupBy('id_jenis_kayu');
        $builder->groupBy('tgl_transaksiz');

        $query = $builder->get();
---
SELECT *, COUNT(`id_jenis_kayu`) AS `id_jenis_kayu`
FROM `db_transaksi`
WHERE `tgl_transaksi` LIKE '%2022-08%' ESCAPE '!'
GROUP BY `id_jenis_kayu`
SELECT sum(total_harga) as hasil_ttl, DATE_FORMAT(tgl_transaksi, "%Y-%M-%d") as tgl_transaksiz, `id_jenis_kayu`, `tgl_transaksi`
FROM `db_transaksi`
WHERE `id_jenis_kayu` = '1'
AND  `tgl_transaksi` LIKE '%2022-01%' ESCAPE '!'
GROUP BY `tgl_transaksiz`
ORDER BY `tgl_transaksi` ASC

    function ChartTTPgetwhere_tahun($bln = null, $thn = null, $typekayu = null)
    {
        $builder = $this->db->table('db_transaksi');
        $builder->select('sum(total_harga) as hasil_ttl, DATE_FORMAT(tgl_transaksi, "%Y-%M") as tgl_transaksiz, tgl_transaksi');


        if ($typekayu != 0) {
            $builder->where('id_jenis_kayu', $typekayu);
        }

        $builder->like('tgl_transaksi', $thn.'-'.$bln);

        $builder->orderBy('tgl_transaksi', 'ASC');

        $builder->groupBy('tgl_transaksiz');
        $query = $builder->get();
---
SELECT sum(total_harga) as hasil_ttl, DATE_FORMAT(tgl_transaksi, "%Y-%M") as tgl_transaksiz, `tgl_transaksi`
FROM `db_transaksi`
WHERE `id_jenis_kayu` = '1'
AND  `tgl_transaksi` LIKE '%2022-%' ESCAPE '!'
GROUP BY `tgl_transaksiz`
ORDER BY `tgl_transaksi` ASC