app/Models/UkuranKayuModel.php

    function getjoinall()
    {
        $builder = $this->db->table('db_ukuran_kayu');
        $builder->join('db_tipe_kayu', 'db_tipe_kayu.id_tipe_kayu = db_ukuran_kayu.id_tipe_kayu');
        $builder->join('db_jenis_kayu', 'db_tipe_kayu.id_jenis_kayu = db_jenis_kayu.id_jenis_kayu');
        $query = $builder->get();
---
SELECT *
FROM `db_ukuran_kayu`
JOIN `db_tipe_kayu` ON `db_tipe_kayu`.`id_tipe_kayu` = `db_ukuran_kayu`.`id_tipe_kayu`
JOIN `db_jenis_kayu` ON `db_tipe_kayu`.`id_jenis_kayu` = `db_jenis_kayu`.`id_jenis_kayu`